agreement_text = (
    "请在继续之前阅读并接受以下用户协议：\n\n"
    "1. 您同意自行承担使用本软件的风险。\n"
    "2. 开发者不对任何数据丢失或损害负责。\n"
    "3. 您同意遵守所有适用的法律法规。\n"
    "4. 该软件仅在公用设备（如网吧、图书馆、学校机房等）上使用，且仅在用户登录Microsoft账户后使用；因退登导致的账户退登（？）、数据丢失或其他问题，作者不承担任何责任。\n"
    "5. 此软件仅在Windows 10/11系统上运行，且仅支持Microsoft账户登录的系统。\n"
    "本项目基于cc0 creative commons协议，您可以自由使用、修改和分发本软件，但请保留原作者信息。\n\n"
    "您是否接受本协议的条款？"
)

agree_check = "我接受本协议的条款"

agreement_warning = "您必须接受用户协议才能继续。"

head = "请选择您要使用的项目。"

panel = "有未列出的内容吗？"
panel_issue = "提交问题"
panel_contrib = "想要参与贡献吗？"
panel_issue = "Fork 本仓库"

run = "运行"
run_warning = "请至少选择一项要运行的项目。"

motto = "钟摆的公平在于从不回头，而人的遗憾则在于总是回望。 --卡夫卡"

finish = "所有选定的项目已执行完毕。"